CytronTechnologies/CT-ARM/variants/NUC131/variant.h
#define ADC_MAX_COUNT (6u)
extern ADCPinDescription ADC_Desc[];
#define ADC_Config(Desc)                                                                                                                                       \
	do                                                                                                                                                         \
	{                                                                                                                                                          \
		outp32(GPIO_Desc[Desc.pintype.num].Pin.MFP, (inp32(GPIO_Desc[Desc.pintype.num].Pin.MFP) & ~GPIO_Desc[Desc.pintype.num].Pin.Mask) | Desc.pintype.type); \
		if (GPIO_Desc[Desc.pintype.num].Pin.ALTMsk != NULL)                                                                                                    \
			outp32(&SYS->ALT_MFP, (inp32(&SYS->ALT_MFP) & ~GPIO_Desc[Desc.pintype.num].Pin.ALTMsk) | Desc.pintype.AMsk);                                       \
		if (GPIO_Desc[Desc.pintype.num].Pin.ALT2Msk != NULL)                                                                                                   \
			outp32(&SYS->ALT_MFP2, (inp32(&SYS->ALT_MFP2) & ~GPIO_Desc[Desc.pintype.num].Pin.ALT2Msk) | Desc.pintype.AMsk2);                                   \
		if (GPIO_Desc[Desc.pintype.num].Pin.ALT3Msk != NULL)                                                                                                   \
			outp32(&SYS->ALT_MFP3, (inp32(&SYS->ALT_MFP3) & ~GPIO_Desc[Desc.pintype.num].Pin.ALT3Msk) | Desc.pintype.AMsk3);                                   \
		if (GPIO_Desc[Desc.pintype.num].Pin.ALT4Msk != NULL)                                                                                                   \
			outp32(&SYS->ALT_MFP4, (inp32(&SYS->ALT_MFP4) & ~GPIO_Desc[Desc.pintype.num].Pin.ALT4Msk) | Desc.pintype.AMsk4);                                   \
	} while (0);

#define SPI_MAX_COUNT (1u)
#define SPI_CHANNELS_NUM (1u)
extern SPIPinDescription SPI_Desc[];
#define SPI_SCK (0u)
#define SPI_MOSI (1u)
#define SPI_MISO (2u)
#define SPI_SS (3u)
#define SPI_Config(Desc)                                                                                        \
	do                                                                                                          \
	{                                                                                                           \
		uint8_t i;                                                                                              \
		for (i = 0; i < 4; i++)                                                                                 \
			if (Desc.pintype[i].num != 0)                                                                       \
				outp32(GPIO_Desc[Desc.pintype[i].num].Pin.MFP, (inp32(GPIO_Desc[Desc.pintype[i].num].Pin.MFP) & \
																~GPIO_Desc[Desc.pintype[i].num].Pin.Mask) |     \
																   Desc.pintype[i].type);                       \
	} while (0);

#define UART_MAX_COUNT (6u)
extern UARTPinDescription UART_Desc[];
#define UART_RX (0u)
#define UART_TX (1u)
#define UART_Config(Desc)                                                                                                                                                      \
	do                                                                                                                                                                         \
	{                                                                                                                                                                          \
		uint8_t i;                                                                                                                                                             \
		for (i = 0; i < 2; i++)                                                                                                                                                \
		{                                                                                                                                                                      \
			outp32(GPIO_Desc[Desc.pintype[i].num].Pin.MFP, (inp32(GPIO_Desc[Desc.pintype[i].num].Pin.MFP) & ~GPIO_Desc[Desc.pintype[i].num].Pin.Mask) | Desc.pintype[i].type); \
			if (GPIO_Desc[Desc.pintype[i].num].Pin.ALTMsk != NULL)                                                                                                             \
				outp32(&SYS->ALT_MFP, (inp32(&SYS->ALT_MFP) & ~GPIO_Desc[Desc.pintype[i].num].Pin.ALTMsk) | Desc.pintype[i].AMsk);                                             \
			if (GPIO_Desc[Desc.pintype[i].num].Pin.ALT2Msk != NULL)                                                                                                            \
				outp32(&SYS->ALT_MFP2, (inp32(&SYS->ALT_MFP2) & ~GPIO_Desc[Desc.pintype[i].num].Pin.ALT2Msk) | Desc.pintype[i].AMsk2);                                         \
			if (GPIO_Desc[Desc.pintype[i].num].Pin.ALT3Msk != NULL)                                                                                                            \
				outp32(&SYS->ALT_MFP3, (inp32(&SYS->ALT_MFP3) & ~GPIO_Desc[Desc.pintype[i].num].Pin.ALT3Msk) | Desc.pintype[i].AMsk3);                                         \
			if (GPIO_Desc[Desc.pintype[i].num].Pin.ALT4Msk != NULL)                                                                                                            \
				outp32(&SYS->ALT_MFP4, (inp32(&SYS->ALT_MFP4) & ~GPIO_Desc[Desc.pintype[i].num].Pin.ALT4Msk) | Desc.pintype[i].AMsk4);                                         \
		}                                                                                                                                                                      \
	} while (0);

#if defined(__M451__) | defined(__NUC240__)
#define CAN_MAX_COUNT 1
extern const CANPinDescription CAN_Desc[];
#define CAN_RX 0
#define CAN_TX 1
#define CAN_Config(Desc)                                                                                    \
	do                                                                                                      \
	{                                                                                                       \
		uint8_t i;                                                                                          \
		for (i = 0; i < 2; i++)                                                                             \
			outp32(GPIO_Desc[Desc.pintype[i].num].Pin.MFP, (inp32(GPIO_Desc[Desc.pintype[i].num].Pin.MFP) & \
															~GPIO_Desc[Desc.pintype[i].num].Pin.Mask) |     \
															   Desc.pintype[i].type);                       \
	} while (0);
#endif

#define I2C_MAX_COUNT (1u)
extern I2CPinDescription I2C_Desc[];
#define I2C_SCL (0u)
#define I2C_SDA (1u)
#define I2C_Config(Desc)                                                                                                                                                       \
	do                                                                                                                                                                         \
	{                                                                                                                                                                          \
		uint8_t i;                                                                                                                                                             \
		for (i = 0; i < 2; i++)                                                                                                                                                \
		{                                                                                                                                                                      \
			outp32(GPIO_Desc[Desc.pintype[i].num].Pin.MFP, (inp32(GPIO_Desc[Desc.pintype[i].num].Pin.MFP) & ~GPIO_Desc[Desc.pintype[i].num].Pin.Mask) | Desc.pintype[i].type); \
			if (GPIO_Desc[Desc.pintype[i].num].Pin.ALTMsk != NULL)                                                                                                             \
				outp32(&SYS->ALT_MFP, (inp32(&SYS->ALT_MFP) & ~GPIO_Desc[Desc.pintype[i].num].Pin.ALTMsk) | Desc.pintype[i].AMsk);                                             \
			if (GPIO_Desc[Desc.pintype[i].num].Pin.ALT2Msk != NULL)                                                                                                            \
				outp32(&SYS->ALT_MFP2, (inp32(&SYS->ALT_MFP2) & ~GPIO_Desc[Desc.pintype[i].num].Pin.ALT2Msk) | Desc.pintype[i].AMsk2);                                         \
			if (GPIO_Desc[Desc.pintype[i].num].Pin.ALT3Msk != NULL)                                                                                                            \
				outp32(&SYS->ALT_MFP3, (inp32(&SYS->ALT_MFP3) & ~GPIO_Desc[Desc.pintype[i].num].Pin.ALT3Msk) | Desc.pintype[i].AMsk3);                                         \
			if (GPIO_Desc[Desc.pintype[i].num].Pin.ALT4Msk != NULL)                                                                                                            \
				outp32(&SYS->ALT_MFP4, (inp32(&SYS->ALT_MFP4) & ~GPIO_Desc[Desc.pintype[i].num].Pin.ALT4Msk) | Desc.pintype[i].AMsk4);                                         \
		}                                                                                                                                                                      \
	} while (0);

#endif /* end GPIO mapping */

/*
 * Pins
 */
#define NUM_DIGITAL_PINS (20u)
#define NUM_ANALOG_INPUTS (6u)
#define analogInputToDigitalPin(p) ((p < 6) ? (p) + 14 : -1)
#define digitalPinHasPWM(p) ((p) >= 2 && (p) <= 17)

#define digitalPinToPort(p) (GPIO_Desc[BoardToPinInfo[p].pin].P)
#define digitalPinToBitMask(p) (1 << GPIO_Desc[BoardToPinInfo[p].pin].bit)
//#define analogInPinToBit(p) (p)
#define portOutputRegister(port) (&(port->DOUT))
#define portInputRegister(port) (&(port->PIN))
#define portModeRegister(port) (&(port->PMD))
/*
 * Interrupts
 */
#define digitalPinToInterrupt(p) ((p >= 0 && p < 30) ? p : NOT_AN_INTERRUPT)
/*
 * SPI Interfaces
 */
static const uint8_t SS = 25;
static const uint8_t MOSI = 24;
static const uint8_t MISO = 22;
static const uint8_t SCK = 23;
/*
 * Wire Interfaces
 */
static const uint8_t SDA = 20;
static const uint8_t SCL = 21;
/*
 * LED
 */
#define LED_BUILTIN (13u)
/*
 * Analog pins
 */
static const uint8_t A0 = 14;
static const uint8_t A1 = 15;
static const uint8_t A2 = 16;
static const uint8_t A3 = 17;
static const uint8_t A4 = 18;
static const uint8_t A5 = 19;

#endif
